---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.RoomBasePowerLoadOnParam
source: html/cfbe6dd2-13c3-dd2f-19dc-75853cb5ba32.htm
---
# Autodesk.Revit.DB.ParameterTypeId.RoomBasePowerLoadOnParam Property

"Base Power Load on"

## Syntax (C#)
```csharp
public static ForgeTypeId RoomBasePowerLoadOnParam { get; }
```